{
    "<PAD>": 0,
    "<UNK>": 1,
    "<START>": 2,
    "<STOP>": 3,
    "(": 4,
    ")": 5,
    "1": 6,
    "2": 7,
    "3": 8,
    "4": 9,
    "5": 10,
    "6": 11,
    "7": 12,
    "8": 13,
    "9": 14,
    "%10": 15,
    "%11": 16,
    "%12": 17,
    "%13": 18,
    "%14": 19,
    "%15": 20,
    "%16": 21,
    "%17": 22,
    "%18": 23,
    "%19": 24,
    "%20": 25,
    "%21": 26,
    "%22": 27,
    "%23": 28,
    "%24": 29,
    "%25": 30,
    "%26": 31,
    "%27": 32,
    "%28": 33,
    "%29": 34,
    "=": 35,
    "[C@@H]": 36,
    "[C@H]": 37,
    " ": 38,
    "C": 39,
    "N": 40,
    "O": 41,
    "c": 42,
    "[nH]": 43,
    "S": 44,
    "n": 45,
    "[Cl-]": 46,
    "[N+]": 47,
    ".": 48,
    "[Na+]": 49,
    "[O-]": 50,
    "Br": 51,
    "[H]": 52,
    "[C@]": 53,
    "[NH4+]": 54,
    "[C@@]": 55,
    "[Hg]": 56,
    "F": 57,
    "Cl": 58,
    "\\": 59,
    "/": 60,
    "#": 61,
    "[Br-]": 62,
    "[N@@]": 63,
    "P": 64,
    "I": 65,
    "[N@]": 66,
    "[Ca++]": 67,
    "[Pt]": 68,
    "[S+]": 69,
    "[As]": 70,
    "B": 71,
    "[Sn]": 72,
    "[I-]": 73,
    "[Co+]": 74,
    "[N@@+]": 75,
    "[K+]": 76,
    "[N-]": 77,
    "[Fe--]": 78,
    "[P+]": 79,
    "[N@+]": 80,
    "[Fe+3]": 81,
    "[Gd+3]": 82,
    "[S-]": 83,
    "[NH+]": 84,
    "[Zn++]": 85,
    "[NH3+]": 86,
    "[Al]": 87,
    "[Hg++]": 88,
    "[Cu++]": 89,
    "[Zn]": 90,
    "[Au-]": 91,
    "[Au]": 92,
    "[P-]": 93,
    "[Cr]": 94,
    "[Cd++]": 95,
    "[Cd]": 96,
    "[Si]": 97,
    "[Sb]": 98,
    "[Se]": 99,
    "[B-]": 100,
    "[Cu]": 101,
    "[Li+]": 102,
    "[O+]": 103,
    "[Tl+]": 104,
    "[Bi]": 105,
    "[In]": 106,
    "[Ca]": 107,
    "[Dy]": 108,
    "[CH-]": 109,
    "[Co++]": 110,
    "[Cr+3]": 111,
    "[Fe++]": 112,
    "[Pt-2]": 113,
    "[Sb+3]": 114,
    "[Be++]": 115,
    "[Mg++]": 116,
    "[Ti]": 117,
    "[Fe-]": 118,
    "[Nd]": 119,
    "[Pd]": 120,
    "[NH2+]": 121,
    "[Ba++]": 122,
    "[H+]": 123,
    "[C-]": 124,
    "[Mn+]": 125,
    "[Mn++]": 126,
    "[SiH]": 127,
    "[Ni++]": 128,
    "[Zr]": 129,
    "[Ni]": 130,
    "[PbH2++]": 131,
    "[Yb]": 132,
    "[Na]": 133,
    "[Mo]": 134,
    "[Cu+]": 135,
    "[O]": 136,
    "[Ge]": 137,
    "[Ba]": 138,
    "[Cr++]": 139,
    "[OH-]": 140,
    "[SnH2++]": 141,
    "[Mg+2]": 142,
    "[V]": 143,
    "[Ag+]": 144,
    "[Pt+2]": 145,
    "[2H]": 146,
    "[Ti++]": 147,
    "[Sr++]": 148,
    "[Ru]": 149,
    "[C+]": 150,
    "[S@@]": 151,
    "[P@]": 152,
    "[I+]": 153,
    "[Li]": 154,
    "[As+]": 155,
    "[Fe]": 156,
    "[Eu]": 157,
    "[Sc]": 158,
    "-": 159,
    "s": 160,
    "o": 161,
    "[n+]": 162,
    "[P]": 163,
    "[N]": 164,
    "[I]": 165,
    "[Br]": 166,
    "[Cl]": 167,
    "[s+]": 168,
    "[I++]": 169,
    "[o+]": 170,
    "[CH2]": 171,
    "[IH]": 172,
    "[CH]": 173,
    "[c-]": 174,
    "p": 175,
    "[C]": 176,
    "[n-]": 177,
    "[cH-]": 178,
    "[c+]": 179,
    "[NH-]": 180,
    "[OH+]": 181,
    "[F]": 182,
    "[nH+]": 183,
    "[se]": 184,
    "[F-]": 185,
    "[SH-]": 186,
    "[CH+]": 187,
    "[CH2-]": 188,
    "[Gd-4]": 189,
    "[Gd-5]": 190,
    "[N@@H+]": 191,
    "[SiH3]": 192,
    "[S]": 193,
    "[BiH3]": 194,
    "[SeH]": 195,
    "[SiH2]": 196,
    "[S@]": 197,
    "[Re]": 198,
    "[SH+]": 199,
    "0": 200,
    ":": 201,
    ",": 202,
    " |": 203,
    "|": 204,
    "[K]": 205,
    " |r|": 206,
    "[N@H+]": 207,
    "[Te]": 208,
    "[Os]": 209,
    "[Ru-]": 210,
    "[Re-]": 211,
    "[P@@]": 212,
    "[Zn+]": 213,
    "[n]": 214,
    "[o]": 215,
    "[s]": 216,
    "[*]": 217,
    "[CH2+]": 218,
    "[S@+]": 219,
    "[S@@+]": 220,
    "[Mn]": 221,
    "[BH-]": 222,
    "[BH3-]": 223,
    "[11CH3]": 224,
    "[PH+]": 225,
    "[W]": 226,
    "[Nb--]": 227,
    "[Pt--]": 228,
    "[Fe-3]": 229,
    "[Al-3]": 230,
    "[Cu-]": 231,
    "[Ag-]": 232,
    "[As-]": 233,
    "[Pd--]": 234,
    "[Se-]": 235,
    "[c]": 236,
    "[3H]": 237,
    "[Co]": 238,
    "[123I]": 239,
    "[BH2-]": 240,
    "[125I]": 241,
    "[18F]": 242,
    "[Se+]": 243,
    "[cH+]": 244,
    "[Sn+2]": 245,
    "[KH]": 246,
    "[Ag]": 247,
    "[Cu+2]": 248,
    "[PH]": 249,
    "[SH]": 250,
    "[P@H]": 251,
    "[P@@H]": 252,
    "[B@@-]": 253,
    "[B@@H-]": 254,
    "[B@H-]": 255,
    "[Cl+3]": 256,
    "[B]": 257,
    "[NH]": 258,
    "[SnH4+2]": 259,
    "[SnH6+3]": 260,
    "[17O]": 261,
    "[18OH]": 262,
    "[F+]": 263,
    "[SnH3]": 264,
    "[PH2]": 265,
    "[Si-]": 266,
    "[NH:6]": 267,
    "[C@@H:12]": 268,
    "[Cl:15]": 269,
    "[CH:8]": 270,
    "[CH3:13]": 271,
    "[C:11]": 272,
    "[O:9]": 273,
    "[C:10]": 274,
    "[NH:14]": 275,
    "[O:5]": 276,
    "[C@H:12]": 277,
    "[SnH2+]": 278,
    "[SnH]": 279,
    "[Sn-]": 280,
    "[si]": 281,
    "[PH4]": 282,
    "[CH2:8]": 283,
    "[NH:5]": 284,
    "[Br:9]": 285,
    "[C:7]": 286,
    "[OH:4]": 287,
    "[O:3]": 288,
    "[C:12]": 289,
    "[C:2]": 290,
    "[Cl:3]": 291,
    "[O:8]": 292,
    "[NH:12]": 293,
    "[NH:10]": 294,
    "[C:6]": 295,
    "[CH3:2]": 296,
    "[CH:7]": 297,
    "[C:9]": 298,
    "[C@@H:13]": 299,
    "[C@H:13]": 300,
    "[OH:6]": 301,
    "[NH:2]": 302,
    "[CH:12]": 303,
    "[CH:4]": 304,
    "[N:11]": 305,
    "[C:13]": 306,
    "[CH:15]": 307,
    "[S@@H]": 308,
    "[BH]": 309,
    "[Sn+3]": 310,
    "[P@+]": 311,
    "[P@@+]": 312,
    "[c:2]": 313,
    "[n:1]": 314,
    "[c:4]": 315,
    "[IH2]": 316,
    "[siH]": 317,
    "[pH]": 318,
    "[SH2]": 319,
    "[S@H]": 320,
    "[SnH2]": 321,
    "[131I]": 322,
    "[B@-]": 323,
    "[SH3]": 324,
    "[25O]": 325,
    "[Br+]": 326,
    "[CH:17]": 327,
    "[CH:16]": 328,
    "[O:13]": 329,
    "[C:21]": 330,
    "[C:19]": 331,
    "[CH:27]": 332,
    "[CH2:26]": 333,
    "[CH3:20]": 334,
    "[CH2:28]": 335,
    "[C:24]": 336,
    "[CH:22]": 337,
    "[CH:25]": 338,
    "[OH:14]": 339,
    "[CH:18]": 340,
    "[C:15]": 341,
    "[C:23]": 342,
    "[CH:23]": 343,
    "[c:17]": 344,
    "[CH:10]": 345,
    "[cH:18]": 346,
    "[cH:19]": 347,
    "[N:13]": 348,
    "[CH2:15]": 349,
    "[CH:24]": 350,
    "[CH2:16]": 351,
    "[OH:2]": 352,
    "[CH2:14]": 353,
    "[CH:11]": 354,
    "[cH:20]": 355,
    "[cH:22]": 356,
    "[cH:21]": 357,
    "[CH:68]": 358,
    "[CH2:78]": 359,
    "[CH:76]": 360,
    "[CH2:82]": 361,
    "[CH:72]": 362,
    "[C:69]": 363,
    "[CH:74]": 364,
    "[C:79]": 365,
    "[CH2:73]": 366,
    "[CH2:77]": 367,
    "[CH:65]": 368,
    "[CH:70]": 369,
    "[O:80]": 370,
    "[CH:75]": 371,
    "[CH:66]": 372,
    "[CH:71]": 373,
    "[CH:67]": 374,
    "[C:81]": 375,
    "[p+]": 376,
    "[124I]": 377,
    "[35S]": 378,
    "[Sn+]": 379,
    "[76Br]": 380,
    "[127I]": 381,
    "[c:22]": 382,
    "[CH3:11]": 383,
    "[O:4]": 384,
    "[c:13]": 385,
    "[N:37]": 386,
    "[c:21]": 387,
    "[CH2:33]": 388,
    "[C:5]": 389,
    "[CH2:32]": 390,
    "[C@H:27]": 391,
    "[c:12]": 392,
    "[NH2:34]": 393,
    "[CH2:38]": 394,
    "[O:28]": 395,
    "[c:14]": 396,
    "[O:36]": 397,
    "[F:31]": 398,
    "[C:30]": 399,
    "[OH:29]": 400,
    "[C:35]": 401,
    "[C@@H:8]": 402,
    "[cH:15]": 403,
    "[C@H:8]": 404,
    "[cH:40]": 405,
    "[C@H:29]": 406,
    "[NH2:38]": 407,
    "[N:33]": 408,
    "[F:27]": 409,
    "[CH:14]": 410,
    "[C:31]": 411,
    "[CH:36]": 412,
    "[CH:39]": 413,
    "[CH:28]": 414,
    "[n:44]": 415,
    "[CH2:37]": 416,
    "[n:43]": 417,
    "[C:32]": 418,
    "[c:41]": 419,
    "[CH2:45]": 420,
    "[CH:13]": 421,
    "[CH2:46]": 422,
    "[OH:34]": 423,
    "[cH:42]": 424,
    "[CH:30]": 425,
    "[C@@H:29]": 426,
    "[32P]": 427,
    "[SiH-]": 428,
    "[14CH3]": 429,
    "[I@@]": 430,
    "[CH:2]": 431,
    "[NH:18]": 432,
    "[c:11]": 433,
    "[CH:5]": 434,
    "[CH3:27]": 435,
    "[cH:24]": 436,
    "[c:23]": 437,
    "[CH:20]": 438,
    "[CH:3]": 439,
    "[CH:19]": 440,
    "[C:14]": 441,
    "[S@:26]": 442,
    "[c:15]": 443,
    "[F:9]": 444,
    "[nH:12]": 445,
    "[cH:25]": 446,
    "[c:8]": 447,
    "[n:10]": 448,
    "[S@@:26]": 449,
    "[C:8]": 450,
    "[C:29]": 451,
    "[c:18]": 452,
    "[c:5]": 453,
    "[Br:28]": 454,
    "[cH:30]": 455,
    "[N+:27]": 456,
    "[cH:7]": 457,
    "[cH:14]": 458,
    "[NH2:19]": 459,
    "[cH:23]": 460,
    "[cH:11]": 461,
    "[OH:13]": 462,
    "[C:1]": 463,
    "[CH2:3]": 464,
    "[N:6]": 465,
    "[S:10]": 466,
    "[C@@H:2]": 467,
    "[C:4]": 468,
    "[C@H:2]": 469,
    "[Cl+]": 470,
    "[OH:11]": 471,
    "[NH2:12]": 472,
    "[S:3]": 473,
    "[CH:9]": 474,
    "[CH2:2]": 475,
    "[CH3:63]": 476,
    "[CH3:31]": 477,
    "[CH3:32]": 478,
    "[NH:20]": 479,
    "[N:54]": 480,
    "[O:41]": 481,
    "[C:57]": 482,
    "[CH2:35]": 483,
    "[O:18]": 484,
    "[CH3:64]": 485,
    "[OH:67]": 486,
    "[C@@H:73]": 487,
    "[C:72]": 488,
    "[C@:16]": 489,
    "[C:44]": 490,
    "[NH2:15]": 491,
    "[C:76]": 492,
    "[NH:70]": 493,
    "[OH:33]": 494,
    "[CH3:4]": 495,
    "[OH:51]": 496,
    "[C:43]": 497,
    "[C:75]": 498,
    "[C:48]": 499,
    "[C:74]": 500,
    "[C@H:47]": 501,
    "[C:42]": 502,
    "[CH:77]": 503,
    "[CH3:53]": 504,
    "[C:78]": 505,
    "[CH2:61]": 506,
    "[N:80]": 507,
    "[O:71]": 508,
    "[CH3:29]": 509,
    "[C:3]": 510,
    "[CH3:52]": 511,
    "[CH2:68]": 512,
    "[C@H:73]": 513,
    "[C@@:16]": 514,
    "[32P@]": 515,
    "[32P@@]": 516,
    "[14CH2]": 517,
    "[CH2:17]": 518,
    "[OH:22]": 519,
    "[CH2:10]": 520,
    "[Br:23]": 521,
    "[N:21]": 522,
    "[O:16]": 523,
    "[C@@H:15]": 524,
    "[CH3:8]": 525,
    "[C:26]": 526,
    "[C@H:15]": 527,
    "[c:6]": 528,
    "[O:21]": 529,
    "[cH:8]": 530,
    "[CH2:18]": 531,
    "[C:17]": 532,
    "[C:20]": 533,
    "[CH3:14]": 534,
    "[CH2:11]": 535,
    "[N:19]": 536,
    "[O:7]": 537,
    "[CH2:12]": 538,
    "[C@@:5]": 539,
    "[cH:13]": 540,
    "[c:3]": 541,
    "[C@H:9]": 542,
    "[C@:5]": 543,
    "[C@@:20]": 544,
    "[135I]": 545,
    "[33P@]": 546,
    "[33P]": 547,
    "[NH:44]": 548,
    "[CH3:28]": 549,
    "[cH:50]": 550,
    "[CH:31]": 551,
    "[CH3:37]": 552,
    "[C:36]": 553,
    "[cH:47]": 554,
    "[CH:32]": 555,
    "[cH:53]": 556,
    "[CH:34]": 557,
    "[N:42]": 558,
    "[c:48]": 559,
    "[n:46]": 560,
    "[c:52]": 561,
    "[NH:40]": 562,
    "[C:38]": 563,
    "[n:27]": 564,
    "[cH:49]": 565,
    "[n:26]": 566,
    "[C:41]": 567,
    "[NH:19]": 568,
    "[C@@H:9]": 569,
    "[17F]": 570
}